Update README.md with mermaid
